Revit 2026 API

# ConnectorOwner Property

---

The host of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Element Owner { get; }
```
```vb
Public ReadOnly Property Owner As Element
	Get
```
```cpp
public:
property Element^ Owner {
	Element^ get ();
}
```
```fsharp
member Owner : Element with get
```

#### Property Value

Element

The element that contains this connector. It may also contain other connectors.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace